Revit 2024 API
RebarBendingDetail.IsBendingDetail Method
 Checks if the input element is a bending detail.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static bool IsBendingDetail(
	Element bendingDetail
)
Visual Basic
Public Shared Function IsBendingDetail ( _
	bendingDetail As Element _
) As Boolean
Visual C++
public:
static bool IsBendingDetail(
	Element^ bendingDetail
)
Parameters
bendingDetail
Type: Autodesk.Revit.DB.Element
 The element that will be checked.
Return Value
 Returns true if the input element is a bending detail, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The bendingDetail should be a bending detail.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace